//
//  Interface.swift
//  MySwiftCompanyon
//
//  Created by Евгений Березенцев on 24.03.2022.
//

// viewDidLoad() - еще не известны реальные размеры элементов
// viewVillAppear() - становятся известны размеры конкретной вью

// UIView -> UIControl -> UISegmentedControl - активные элементы
// UIView -> UILabel - те с которыми юзеру нельзя напрямую взаимодействовать


// Создавая приложение для меньшего экрана,потом проще адаптировать под большие
// Поэтому в констрейнтах между элементами можно будет указать не только "=", но и ">="

// Рекомендуется использовать стэк вью для удобства и гибкости адаптации
