//
//  Closures.swift
//  MySwiftCompanyon
//
//  Created by Евгений Березенцев on 21.03.2022.
//

// Виды замыканий: - Глобальные, функции с именем и не захватывающие никакие значения
//                 - Вложенные, тоже с именем, но при этом могут использовать и захватывать                    начения из родительской функции
//                 - Замыкающие выражения, безымянные, в облегченном синтаксисе и могут                        захватывать значения из контекста

//func someFunction(first: Int, second: Int) -> Int {
//
//}

//let someClosure = { (first: Int, second: Int) -> Int in
//}


