
import Foundation

"""
    
    - Глобальная и локальная зона видимости ( куча и стэк )
    
    - Присвоение через тернарный оператор let c = a < b ? 5 : 10
    
    - Массив считается тяжелым типом так как нужно индексировать и присваивать индекс
    
    - comand + option и [ или ]  перенос строк
    
    Полезные комманды:
    
    - type(of: T)  возврващает тип, например type(of: self) вернет тип родительского класса
    
    - Self.self тип класса type(of: self)
    
    - pow(5, 5)  возведение в степень числа    - pow(Double(a),2) если дабл
    
    - .isMultyple(of: ..)  кратность

    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    
    """
