
import Foundation

/*
 
 // Class - это reference(ссылочный тип)
 
 Правила:
 Описывает один обект
 нейминг - сущность
 икапсуляция
 1 метод - 1 задача
 не использовать параметры в методе  для временных данных
 
 let firstPost = Post() экземпляр класса (обект-ссылка на обект в памяти)
 let secondPost = firstPost  это ссылка в памяти на тот же экземпляр с другим названием
 let secondPost() второй экземпляр класса
 оператор сравнения ссылок на класс first === second    -> true or false
 
 init() {}  //  инициализатор это параметры в скобках при создании экземпляра класса -  Class(parameters)
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 
 */
