//
//  Clean Swift.swift
//  MySwiftCompanyon
//
//  Created by Евгений Березенцев on 05.06.2021.
//

import Foundation

let rules = """

 Комментирование //, /* ### */,  // MARK: -

  - Чем меньше кода тем лучше
  - Изначально присваивать let
  - Не указывать тип явно, тип зависит от значения переменной
  - В булевом при значении true  не указывать == true

  - "Умные" пробелы между строками: Свойства - Методы - и т.п.
        
  - Массив присваивать let если не планируем менять,не называть Array - просто множ. число
    Пробел после запятой
    Умные переносы
  
















"""
