
import Foundation

let Some = """
    
    - Глобальная и локальная зона видимости ( куча и стэк )
    
    - Классы для абстракций а структуры для объектов
    
    - Присвоение через тернарный оператор let c = a < b ? 5 : 10
    
    - Массив считается тяжелым типом так как нужно индексировать и присваивать индекс
    
    - comand + option и [ или ]  перенос строк
    
    -  Object declaration { }() - unonimous closures
    
    Полезные комманды:
    
    - type(of: T)  возврващает тип, например type(of: self) вернет тип родительского класса
    
    - Self.self тип класса type(of: self)
    
    - pow(5, 5)  возведение в степень числа    - pow(Double(a),2) если дабл
    
    - .isMultyple(of: ..)  кратность
    
    - sqrt(a * b)
    
    round(a * 1000) / 1000 или %.3f ,a   где 3 это кол/во знаков после,

    lround целое число
    
    """
